In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  0.987053  0.233516
1    a  two -1.957670 -0.249600
2    b  one  1.314761 -0.450672
3    b  two -0.062315 -0.774823
4    a  one  0.948030 -0.136120

In [3]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [4]:
grouped.mean()

key1
a   -0.007529
b    0.626223
Name: data1, dtype: float64

In [6]:
means=df['data1'].groupby([df['key1'],df['key2']])

In [7]:
means.mean()

key1  key2
a     one     0.967541
      two    -1.957670
b     one     1.314761
      two    -0.062315
Name: data1, dtype: float64

In [9]:
means.unstack()

AttributeError: Cannot access callable attribute 'unstack' of 'SeriesGroupBy' objects, try using the 'apply' method

In [10]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.967541
      two    -1.957670
b     one     1.314761
      two    -0.062315
Name: data1, dtype: float64

In [13]:
means.unstack(0)

key1         a         b
key2
one   0.967541  1.314761
two  -1.957670 -0.062315

In [39]:
states = np.array(['klio', 'Cagifornia', 'California', 'Ohio', 'Ohio','fgg'])
years = np.array([2005, 2005, 2006, 2008, 2009,7888])

In [40]:
states

array(['klio', 'Cagifornia', 'California', 'Ohio', 'Ohio', 'fgg'],
      dtype='<U10')

In [41]:
df['data1'].groupby([states, years]).mean()

ValueError: Grouper and axis must be same length

In [18]:
df['data1']

0    0.987053
1   -1.957670
2    1.314761
3   -0.062315
4    0.948030
Name: data1, dtype: float64

In [19]:
df

  key1 key2     data1     data2
0    a  one  0.987053  0.233516
1    a  two -1.957670 -0.249600
2    b  one  1.314761 -0.450672
3    b  two -0.062315 -0.774823
4    a  one  0.948030 -0.136120

In [42]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.007529 -0.050735
b     0.626223 -0.612748

In [43]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.967541  0.048698
     two  -1.957670 -0.249600
b    one   1.314761 -0.450672
     two  -0.062315 -0.774823

In [46]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [47]:
df

  key1 key2     data1     data2
0    a  one  0.987053  0.233516
1    a  two -1.957670 -0.249600
2    b  one  1.314761 -0.450672
3    b  two -0.062315 -0.774823
4    a  one  0.948030 -0.136120

In [59]:
for i,j in df.groupby('key1'):

  print(i)

a
b

In [60]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.987053  0.233516
4    a  one  0.948030 -0.136120
('a', 'two')
  key1 key2    data1   data2
1    a  two -1.95767 -0.2496
('b', 'one')
  key1 key2     data1     data2
2    b  one  1.314761 -0.450672
('b', 'two')
  key1 key2     data1     data2
3    b  two -0.062315 -0.774823

In [62]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [67]:
pieces = dict(list(df.groupby('key1')))

In [72]:
dict()

{1: 2, 3: 4}

In [73]:
[(1,2),(3,4)]

[(1, 2), (3, 4)]

In [74]:
df

  key1 key2     data1     data2
0    a  one  0.987053  0.233516
1    a  two -1.957670 -0.249600
2    b  one  1.314761 -0.450672
3    b  two -0.062315 -0.774823
4    a  one  0.948030 -0.136120

In [77]:
sc=df.groupby(df.dtypes,axis=1)

In [80]:
for i,j in sc:
    print(i)
    print(j)

float64
      data1     data2
0  0.987053  0.233516
1 -1.957670 -0.249600
2  1.314761 -0.450672
3 -0.062315 -0.774823
4  0.948030 -0.136120
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

In [81]:
df1

NameError: name 'df1' is not defined

In [82]:
df

  key1 key2     data1     data2
0    a  one  0.987053  0.233516
1    a  two -1.957670 -0.249600
2    b  one  1.314761 -0.450672
3    b  two -0.062315 -0.774823
4    a  one  0.948030 -0.136120

In [90]:
for i,j in list(df.groupby('key1')['data1']):
    print(i)
    print(j)

a
0    0.987053
1   -1.957670
4    0.948030
Name: data1, dtype: float64
b
2    1.314761
3   -0.062315
Name: data1, dtype: float64

In [92]:
list(df.groupby('key1')['data1'])

[('a', 0    0.987053
  1   -1.957670
  4    0.948030
  Name: data1, dtype: float64), ('b', 2    1.314761
  3   -0.062315
  Name: data1, dtype: float64)]

In [96]:
df['data2'].groupby([df['key1'],df['key2']]).mean()

key1  key2
a     one     0.048698
      two    -0.249600
b     one    -0.450672
      two    -0.774823
Name: data2, dtype: float64

In [102]:
df.groupby(['key1', 'key2'])[[2]].mean()

KeyError: 'Columns not found: 2'

In [101]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [103]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [104]:
people

               a         b         c         d         e
Joe     0.206157  0.668373 -0.509946  0.353102 -0.411456
Steve   0.339994 -0.565462  0.313327 -0.326754 -2.156167
Wes    -0.555731 -1.304116  0.451627 -1.613846 -0.106641
Jim     0.239692 -0.806566  0.518220  0.926401  0.550910
Travis  1.670248 -0.797821 -0.525228  0.071946  0.678800

In [105]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values
people

               a         b         c         d         e
Joe     0.206157  0.668373 -0.509946  0.353102 -0.411456
Steve   0.339994 -0.565462  0.313327 -0.326754 -2.156167
Wes    -0.555731       NaN       NaN -1.613846 -0.106641
Jim     0.239692 -0.806566  0.518220  0.926401  0.550910
Travis  1.670248 -0.797821 -0.525228  0.071946  0.678800

In [106]:
by=people.groupby(people.dtypes,axis=1)

In [107]:
by

In [108]:
list(by)

[(dtype('float64'),                a         b         c         d         e
  Joe     0.206157  0.668373 -0.509946  0.353102 -0.411456
  Steve   0.339994 -0.565462  0.313327 -0.326754 -2.156167
  Wes    -0.555731       NaN       NaN -1.613846 -0.106641
  Jim     0.239692 -0.806566  0.518220  0.926401  0.550910
  Travis  1.670248 -0.797821 -0.525228  0.071946  0.678800)]

In [109]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
           'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [110]:
cyu=people.groupby(mapping,axis=1)

In [113]:
cyu.sum()

            blue       red
Joe    -0.156844  0.463074
Steve  -0.013427 -2.381635
Wes    -1.613846 -0.662372
Jim     1.444621 -0.015965
Travis -0.453282  1.551227

In [114]:
ser=pd.Series(mapping)

In [115]:
ser

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [116]:
people.groupby(ser,axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

In [117]:
people

               a         b         c         d         e
Joe     0.206157  0.668373 -0.509946  0.353102 -0.411456
Steve   0.339994 -0.565462  0.313327 -0.326754 -2.156167
Wes    -0.555731       NaN       NaN -1.613846 -0.106641
Jim     0.239692 -0.806566  0.518220  0.926401  0.550910
Travis  1.670248 -0.797821 -0.525228  0.071946  0.678800

In [118]:
people.groupby(len)

In [119]:
list(people.groupby(len))

[(3,             a         b         c         d         e
  Joe  0.206157  0.668373 -0.509946  0.353102 -0.411456
  Wes -0.555731       NaN       NaN -1.613846 -0.106641
  Jim  0.239692 -0.806566  0.518220  0.926401  0.550910),
 (5,               a         b         c         d         e
  Steve  0.339994 -0.565462  0.313327 -0.326754 -2.156167),
 (6,                a         b         c         d       e
  Travis  1.670248 -0.797821 -0.525228  0.071946  0.6788)]

In [121]:
key_list = ['one', 'one', 'one', 'two', 'two']
list(people.groupby([len, key_list]))

[((3, 'one'),             a         b         c         d         e
  Joe  0.206157  0.668373 -0.509946  0.353102 -0.411456
  Wes -0.555731       NaN       NaN -1.613846 -0.106641),
 ((3, 'two'),             a         b        c         d        e
  Jim  0.239692 -0.806566  0.51822  0.926401  0.55091),
 ((5, 'one'),               a         b         c         d         e
  Steve  0.339994 -0.565462  0.313327 -0.326754 -2.156167),
 ((6, 'two'),                a         b         c         d       e
  Travis  1.670248 -0.797821 -0.525228  0.071946  0.6788)]

In [122]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])

In [123]:
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           codes=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [124]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [125]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.431369 -2.686412  1.332207  0.406594 -1.403635
1      1.025698 -0.462011  0.901354  0.166612 -1.388160
2      1.875594  0.923303  0.404469  0.343481  1.929615
3      0.621026  0.351603 -0.206110  1.727696 -0.282039

In [126]:
hier_df.groupby(level='cty',axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [127]:
df

  key1 key2     data1     data2
0    a  one  0.987053  0.233516
1    a  two -1.957670 -0.249600
2    b  one  1.314761 -0.450672
3    b  two -0.062315 -0.774823
4    a  one  0.948030 -0.136120

In [130]:
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

key1
a    0.979248
b    1.177054
Name: data1, dtype: float64

In [132]:
grouped.agg()

key1                a         b
data1 count  3.000000  2.000000
      mean  -0.007529  0.626223
      std    1.688984  0.973740
      min   -1.957670 -0.062315
      25%   -0.504820  0.281954
      50%    0.948030  0.626223
      75%    0.967541  0.970492
      max    0.987053  1.314761
data2 count  3.000000  2.000000
      mean  -0.050735 -0.612748
      std    0.252623  0.229210
      min   -0.249600 -0.774823
      25%   -0.192860 -0.693785
      50%   -0.136120 -0.612748
      75%    0.048698 -0.531710
      max    0.233516 -0.450672

In [133]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})

In [134]:
quartiles = pd.cut(frame.data1, 4)

In [135]:
quartiles[:10]

0     (-1.22, 0.212]
1    (-2.658, -1.22]
2     (0.212, 1.644]
3     (-1.22, 0.212]
4    (-2.658, -1.22]
5     (-1.22, 0.212]
6     (-1.22, 0.212]
7     (-1.22, 0.212]
8     (-1.22, 0.212]
9     (-1.22, 0.212]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-2.658, -1.22] < (-1.22, 0.212] < (0.212, 1.644] < (1.644, 3.076]]

In [140]:
def get_stats(group):
    return {'mjhhn': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}

In [141]:
grouped = frame.data2.groupby(quartiles)

In [142]:
grouped.apply(get_stats)

data1
(-2.658, -1.22]  count    112.000000
                 max        2.059405
                 mean      -0.136389
                 mjhhn     -2.770118
(-1.22, 0.212]   count    469.000000
                 max        2.827896
                 mean       0.014390
                 mjhhn     -2.842285
(0.212, 1.644]   count    364.000000
                 max        2.678961
                 mean      -0.126814
                 mjhhn     -2.932517
(1.644, 3.076]   count     55.000000
                 max        2.930203
                 mean       0.145435
                 mjhhn     -2.369588
Name: data2, dtype: float64

In [143]:
s = pd.Series(np.random.randn(6))
s[::2] = np.nan
s
s.fillna(s.mean())

0   -0.438859
1   -0.398885
2   -0.438859
3    0.657352
4   -0.438859
5   -1.575045
dtype: float64

In [144]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.Series(np.random.randn(8), index=states)
data

Ohio          0.055644
New York     -0.799301
Vermont      -1.606629
Florida       0.257867
Oregon       -0.976010
Nevada       -1.078235
California    1.099438
Idaho         0.955503
dtype: float64

In [145]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})
df

  category      data   weights
0        a  0.430283  0.269864
1        a  0.737742  0.834873
2        a  0.555060  0.929810
3        a -1.037021  0.302462
4        b  0.249344  0.936212
5        b -0.822940  0.340357
6        b  0.943781  0.520901
7        b  1.728190  0.624085

In [146]:
grouped = df.groupby('category')
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])
grouped.apply(get_wavg)

category
a    0.399862
b    0.629141
dtype: float64

In [147]:
close_px = pd.read_csv('examples/stock_px_2.csv', parse_dates=True,
                       index_col=0)
close_px.info()
close_px[-4:]

FileNotFoundError: [Errno 2] File b'examples/stock_px_2.csv' does not exist: b'examples/stock_px_2.csv'

In [148]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [149]:
tips.pivot_table(index=['day', 'smoker'])

NameError: name 'tips' is not defined

In [150]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker')

NameError: name 'tips' is not defined

In [151]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker', margins=True)

NameError: name 'tips' is not defined

In [152]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
                 aggfunc=len, margins=True)

NameError: name 'tips' is not defined

In [153]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                 columns='day', aggfunc='mean', fill_value=0)

NameError: name 'tips' is not defined

In [154]:
from io import StringIO
data = """\
Sample  Nationality  Handedness
1   USA  Right-handed
2   Japan    Left-handed
3   USA  Right-handed
4   Japan    Right-handed
5   Japan    Left-handed
6   Japan    Right-handed
7   USA  Right-handed
8   USA  Left-handed
9   Japan    Right-handed
10  USA  Right-handed"""
data = pd.read_table(StringIO(data), sep='\s+')

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:14: FutureWarning: read_table is deprecated, use read_csv instead.

In [155]:
data

   Sample Nationality    Handedness
0       1         USA  Right-handed
1       2       Japan   Left-handed
2       3         USA  Right-handed
3       4       Japan  Right-handed
4       5       Japan   Left-handed
5       6       Japan  Right-handed
6       7         USA  Right-handed
7       8         USA   Left-handed
8       9       Japan  Right-handed
9      10         USA  Right-handed

In [156]:
pd.crosstab(data.Nationality, data.Handedness, margins=True)

Handedness   Left-handed  Right-handed  All
Nationality
Japan                  2             3    5
USA                    1             4    5
All                    3             7   10

In [157]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

NameError: name 'tips' is not defined